org/work/tips-to-live-by.org
#+TITLE: Tips to live by
#+SETUPFILE: ./.section-setup.org

* It's not about being right nor prove others wrong

- *Corollary 1*: if it's wrong but it works, then it's not wrong.
- *Corollary 2*: if you're right but it doesn't change the outcome, then it doesn't matter.
- *Corollary 3*: if you're right, but it doesn't work, then you're wrong.
- *Corollary 4*: if you prove someone else wrong, but their answer works and yours doesn't, then they're right and you're wrong.
- *Corollary 5*: if you prove someone's solution to be wrong even though it does provide value, then you have not yet provided any value until you propose something better.
