content/docs/work/tips-to-live-by.md
+++
title = "Tips to live by"
author = ["Bruno Henriques"]
draft = false
+++

## It's not about being right nor prove others wrong {#it-s-not-about-being-right-nor-prove-others-wrong}


### **Corollary 1**: if it's wrong but it works, then it's not wrong. {#corollary-1-if-it-s-wrong-but-it-works-then-it-s-not-wrong-dot}


### **Corollary 2**: if you're right but it doesn't change the outcome, then it doesn't matter. {#corollary-2-if-you-re-right-but-it-doesn-t-change-the-outcome-then-it-doesn-t-matter-dot}


### **Corollary 3**: if you're right, but it doesn't work, then you're wrong. {#corollary-3-if-you-re-right-but-it-doesn-t-work-then-you-re-wrong-dot}


### **Corollary 4**: if you prove someone else wrong, but their answer works and yours doesn't, then they're right and you're wrong. {#corollary-4-if-you-prove-someone-else-wrong-but-their-answer-works-and-yours-doesn-t-then-they-re-right-and-you-re-wrong-dot}


### **Corollary 5**: if you prove someone's solution to be wrong even though it does provide value, then you have not yet provided any value until you propose something better. {#corollary-5-if-you-prove-someone-s-solution-to-be-wrong-even-though-it-does-provide-value-then-you-have-not-yet-provided-any-value-until-you-propose-something-better-dot}
